[MITRE ATT&CK](https://attack.mitre.org/techniques/T1003/001/#uses-DS0017)

`search_range`
(index=win_sysmon EventCode=1 Image="*powershell.exe" CommandLine IN ("*Invoke-Mimikatz*", "*procdump.exe -ma lsass*", "*rundll32.exe*comsvcs.dll*MiniDump*", "*taskmgr.exe* /dump*")) OR 
(index=win_powershell EventCode=4104 Message IN ("*Invoke-Mimikatz*", "*procdump.exe -ma lsass*", "*rundll32.exe*comsvcs.dll*MiniDump*", "*taskmgr.exe* /dump*"))
| eval hunting_trigger="mitre-detection-strategy",
mitre_category="Credential Access",
mitre_technique="OS Credential Dumping",
mitre_technique_id="T0003",
mitre_subtechnique="LSASS Memory", 
mitre_subtechnique_id="001",
mitre_link="https://attack.mitre.org/techniques/T1003/001/#uses-DS0017",
mitre_version="v17",
creator="Cpl Dougherty",
upload_date="2025-10-18",
last_modify_date="2025-10-18",
last_tested="yyyy-mm-dd",
priority="Critical"
| eval enrichment = mvjoin(mvappend("Trigger=".hunting_trigger,
                                    "MITRE Category=".mitre_category, 
                                    "MITRE Technique=".mitre_technique . ":" . mitre_subtechnique, 
                                    "MITRE Code=".mitre_technique_id . "." . mitre_subtechnique_id, 
                                    "Ref=".mitre_link, 
                                    "Ver=".mitre_version, 
                                    "Author=".creator, 
                                    "Upload=".upload_date, 
                                    "Modify=".last_modify_date, 
                                    "Tested=".last_tested, 
                                    "Priority=".priority), "
")
| eval _raw = mvjoin(mvappend(enrichment, "___________________________________________________", "", _raw), "
")
| eval indextime = _indextime
| convert ctime(indextime)
| table `table_sysmon`, `table_powershell`
| collect `jarvis_index`
